jfazekas21/ESP32S3-fishBowl/sdkconfig.defaults
# ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"

# WiFi configuration
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# WiFi scan configuration
CONFIG_ESP_WIFI_SCAN_ALLOW_SCAN_ACTIVE=y

# Log level for WiFi component (reduce verbosity)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# FreeRTOS tick rate (default 100Hz is fine for background tasks)
CONFIG_FREERTOS_HZ=100

# NVS (required for WiFi calibration data)
CONFIG_NVS_ENABLED=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
